-- dimension table to store the city information, with a unique constraint on city_id to prevent duplicates
create table if not exists dim_city (
    id BIGINT PRIMARY KEY,
    name VARCHAR(255),
    lat FLOAT,
    lon FLOAT
)
;

insert into dim_city (id, name, lat, lon) values
(1563287, "Tuyên Quang", 21.8223, 105.2196),
(1576303, "Lào Cai", 22.4833, 103.9566),
(1566319, "Thái Nguyên", 21.5938, 105.8486),
(1905577, "Phú Thọ", 21.3333, 105.1333),
(1591449, "Bắc Ninh", 21.1864, 106.0767),
(1905699, "Hưng Yên", 20.8672, 106.0144),
(1581298, "Hải Phòng", 20.8449, 106.6881),
(1571968, "Ninh Bình", 20.25, 105.974),
(1568738, "Quảng Trị", 16.75, 107.2),
(1594018, "Thành phố Đà Nẵng", 16.0544, 108.2022),
(1568770, "Quảng Ngãi", 15.12, 108.8),
(1581088, "Gia Lai", 13.75, 108.25),
(1565654, "Khánh Hoà", 12.2483, 109.1963),
(1577882, "Lâm Đồng", 11.5833, 108.4833),
(1586896, "Đắk Lắk", 12.6667, 108.05),
(1580578, "Thành phố Hồ Chí Minh", 10.8333, 106.6667),
(1587923, "Đồng Nai", 10.95, 106.8167),
(1566559, "Tây Ninh", 11.3333, 106.1),
(1586203, "Thành phố Cần Thơ", 10.0324, 105.7834),
(1562693, "Vĩnh Long", 10.25, 105.9667),
(1582562, "Đồng Tháp", 10.7167, 105.6333),
(1586443, "Cà Mau", 9.1833, 105.15),
(1594446, "An Giang", 10.5, 105.1667),
(1561096, "Thành phố Hà Nội", 21.0294, 105.8544),
(1580240, "Thành phố Huế", 16.4643, 107.5863),
(1570815, "Lai Châu", 22.401, 103.4529),
(1583477, "Điện Biên", 21.3922, 103.0234),
(1567681, "Sơn La", 21.325, 103.9),
(1576633, "Lạng Sơn", 21.845, 106.7575),
(1580410, "Quảng Ninh", 20.9528, 107.08),
(1566166, "Thanh Hoá", 19.7995, 105.7772),
(1559969, "Nghệ An", 19.3333, 104.833),
(1581047, "Hà Tĩnh", 18.333, 105.9027),
(1586185, "Cao Bằng", 22.6667, 106.25)
;
